Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SurfaceTriangulationFailed
The Site Surface failed to triangulate.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SurfaceSplitNoIntersection
The splitting boundary must divide the Surface into separate pieces. There may be a gap in the splitting Lines or the Sketch may be incomplete.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SurfaceSplitError
The splitting boundary must split the Surface into exactly two pieces.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SurfaceSplit
The splitting boundary must split the Surface into exactly two pieces.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SurfaceSelfIntersection
The splitting boundary drawn would result in a self-intersection of the surface boundary. Please edit your splitting lines to correct the problem.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SiteRegionOptionConflict
Subregions must be in the same Design Option as their Toposurface.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SitePhasesDontOverlap
The phases of the two surfaces you are merging do not overlap. You can continue the operation, or cancel it and select a different pair of surfaces.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SiteMergeDisconnected
The two surfaces you are trying to merge are disconnected from one another. They should overlap, or at least share edges.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SiteEditPointsInvisible
Topographic elements are not visible in your current view. You can modify View Range settings in the view's Properties or Visibility settings in Visibility/Graphics. It is often easier to edit topography in a Site view or a 3D view.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SiteEditPointsClipped
Portions of the topographic surface or points on the surface may not be visible in this view due to clipping by the view.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.ResetToposurfacePhaseCreated
The parameter Phase Created of the Toposurface is not set to the first Phase. No pre-existing toposurface were detected. The parameter will be reset to the first Phase unless Keep Phase Created option is picked.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.RegionPhaseMismatch
Subregions must have the same Phase Created parameter and Phase Demolished parameter as the host Toposurface. Subregion phase will be set to match the Toposurface.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.PropertyIntersect
Property lines intersect.  Area calculations will not be precise.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.PointRelativeOutside
In order to place Points relative to the existing Surface, the Point must be placed within the area of the existing Surface. The height of the new Point will be relative to the current Surface elevation at that Point.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.PointNotInSurface
A Point is outside of the Surface boundary. Insert the Point on the boundary instead, and then drag it to the desired location.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.NotEnoughPointsInSurface
The surface must have at least three distinct Points.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.NoHostForSubregionWarn
This Subregion now does not appear to overlap any Toposurface with an appropriate Phase and Design Option.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.NoHostForSubregion
This Subregion now does not appear to overlap any Toposurface with an appropriate Phase and Design Option.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.GradingInSamePhase
The Surface being Graded was created in the current Phase. Grading it will result in it being created and destroyed in the same Phase.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.EnterValueOrFormula
Enter a value or a formula starting with '='.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.ContourLabelEmpty
Contour Label doesn't intersect any contours.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.CannotMakeSurface
Can't construct surface.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.CannotIntersectSiteRegions
Subregions cannot intersect.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.CannotComputeProperArea
Property Lines must close. Area will not be computed.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.BuildingPadOverlap
Pads can't overlap (but can share edges).

Autodesk.Revit.DB.BuiltInFailures.SiteFailures.BuildingPadNotConnected
Can't create a single Pad with several connected regions.

Autodesk.Revit.DB.BuiltInFailures.SiteFailures
Failures about Site.